![png](movies_ERD.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine 
from sqlalchemy_utils import database_exists, create_database
import pymysql 
from urllib.parse import quote_plus
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
username = "root"
password = "6236265.Scz" 

db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
if database_exists(connection):
    print('It exists')
else:
    create_databse(connection)
    print ('Database created')

It exists

In [4]:
q= '''SHOW TABLES;'''
pd.read_sql(q, engine)

          Tables_in_movies
0                   genres
1                  ratings
2             title_basics
3  title_basics_has_genres

In [5]:
basics = pd.read_csv('Data/title.basics.tsv.gz', compression='gzip', sep='\t', low_memory=False)

basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10017011 entries, 0 to 10017010
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 687.8+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [6]:
basics.to_sql

<bound method NDFrame.to_sql of              tconst  titleType               primaryTitle  \
0         tt0000001      short                 Carmencita
1         tt0000002      short     Le clown et ses chiens
2         tt0000003      short             Pauvre Pierrot
3         tt0000004      short                Un bon bock
4         tt0000005      short           Blacksmith Scene
...             ...        ...                        ...
10017006  tt9916848  tvEpisode              Episode #3.17
10017007  tt9916850  tvEpisode              Episode #3.19
10017008  tt9916852  tvEpisode              Episode #3.20
10017009  tt9916856      short                   The Wind
10017010  tt9916880  tvEpisode  Horrid Henry Knows It All

                      originalTitle isAdult startYear endYear runtimeMinutes  \
0                        Carmencita       0      1894      \N              1
1            Le clown et ses chiens       0      1892      \N              5
2                    Pauvre Pierrot       0      1892      \N              4
3                       Un bon bock       0      1892      \N             12
4                  Blacksmith Scene       0      1893      \N              1
...                             ...     ...       ...     ...            ...
10017006              Episode #3.17       0      2009      \N             \N
10017007              Episode #3.19       0      2010      \N             \N
10017008              Episode #3.20       0      2010      \N             \N
10017009                   The Wind       0      2015      \N             27
10017010  Horrid Henry Knows It All       0      2014      \N             10

                              genres
0                  Documentary,Short
1                    Animation,Short
2           Animation,Comedy,Romance
3                    Animation,Short
4                       Comedy,Short
...                              ...
10017006         Action,Drama,Family
10017007         Action,Drama,Family
10017008         Action,Drama,Family
10017009                       Short
10017010  Adventure,Animation,Comedy

[10017011 rows x 9 columns]>

In [7]:
ratings = pd.read_csv('title.ratings.tsv.gz', low_memory= False)

ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1331492 entries, 0 to 1331491
Data columns (total 1 columns):
 #   Column                         Non-Null Count    Dtype
---  ------                         --------------    -----
 0   tconst	averageRating	numVotes  1331492 non-null  object
dtypes: object(1)
memory usage: 10.2+ MB

  tconst\taverageRating\tnumVotes
0            tt0000001\t5.7\t1988
1             tt0000002\t5.8\t265
2            tt0000003\t6.5\t1849
3             tt0000004\t5.5\t178
4            tt0000005\t6.2\t2632

In [8]:
genres= pd.read_csv('title-akas-us-only.csv',low_memory=False)

genres.info()
genres.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1452564 entries, 0 to 1452563
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1452564 non-null  object
 1   ordering         1452564 non-null  int64
 2   title            1452564 non-null  object
 3   region           1452564 non-null  object
 4   language         1452564 non-null  object
 5   types            1452564 non-null  object
 6   attributes       1452564 non-null  object
 7   isOriginalTitle  1452564 non-null  object
dtypes: int64(1), object(7)
memory usage: 88.7+ MB

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
1,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
3,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
4,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0

In [9]:
max_allowed_length = 255  

genres['title'] = genres['title'].str[:max_allowed_length]
genres.to_sql("title_genres", conn, index=False, if_exists='append')

1452564

In [10]:
# Display the first few rows of the DataFrame
print(ratings.head())

  tconst\taverageRating\tnumVotes
0            tt0000001\t5.7\t1988
1             tt0000002\t5.8\t265
2            tt0000003\t6.5\t1849
3             tt0000004\t5.5\t178
4            tt0000005\t6.2\t2632

In [11]:
basics.to_sql(name='basics', con=conn, index=False, if_exists='append')

10017011

In [12]:
ratings.to_sql(name='ratings', con=conn, index=False, if_exists='replace')

1331492

In [13]:
genres.to_sql(name='genres', con=conn, index=False, if_exists='replace')

1452564

In [14]:
q= '''SHOW TABLES;'''
pd.read_sql(q, engine)

          Tables_in_movies
0                   basics
1                   genres
2                  ratings
3             title_basics
4  title_basics_has_genres
5             title_genres

In [15]:
q= '''DESCRIBE title_basics;'''
pd.read_sql(q, engine)

            Field         Type Null  Key Default Extra
0         t_const          int   NO  PRI    None
1   primary_title  varchar(55)  YES         None
2      start_year  varchar(55)  YES         None
3         runtime  varchar(55)  YES         None
4  ratings_tconst          int   NO  PRI    None

In [16]:
q= '''DESCRIBE genres;'''
pd.read_sql(q, engine)

             Field    Type Null Key Default Extra
0          titleId    text  YES        None
1         ordering  bigint  YES        None
2            title    text  YES        None
3           region    text  YES        None
4         language    text  YES        None
5            types    text  YES        None
6       attributes    text  YES        None
7  isOriginalTitle    text  YES        None

In [17]:
q= '''DESCRIBE ratings;'''
pd.read_sql(q, engine)

                             Field  Type Null Key Default Extra
0  tconst\taverageRating\tnumVotes  text  YES        None

In [18]:
q= '''SELECT * FROM basics LIMIT 5;'''
pd.read_sql(q, engine)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [19]:
q= '''SELECT * FROM ratings LIMIT 5;'''
pd.read_sql(q, engine)

  tconst\taverageRating\tnumVotes
0            tt0000001\t5.7\t1988
1             tt0000002\t5.8\t265
2            tt0000003\t6.5\t1849
3             tt0000004\t5.5\t178
4            tt0000005\t6.2\t2632

In [20]:
q= '''SELECT * FROM genres LIMIT 5;'''
pd.read_sql(q, engine)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
1,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
3,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
4,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0